reports/performance/raw/microservices-run2.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: performance/k6-core-flow.js
        output: -

     scenarios: (100.00%) 1 scenario, 2 max VUs, 1m0s max duration (incl. graceful stop):
              * product_list: 2 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
product_list   [   3% ] 2 VUs  01.0s/30s

running (0m02.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
product_list   [   7% ] 2 VUs  02.0s/30s

running (0m03.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
product_list   [  10% ] 2 VUs  03.0s/30s

running (0m04.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
product_list   [  13% ] 2 VUs  04.0s/30s

running (0m05.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
product_list   [  17% ] 2 VUs  05.0s/30s

running (0m06.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
product_list   [  20% ] 2 VUs  06.0s/30s

running (0m07.0s), 2/2 VUs, 12 complete and 0 interrupted iterations
product_list   [  23% ] 2 VUs  07.0s/30s

running (0m08.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
product_list   [  27% ] 2 VUs  08.0s/30s

running (0m09.0s), 2/2 VUs, 16 complete and 0 interrupted iterations
product_list   [  30% ] 2 VUs  09.0s/30s

running (0m10.0s), 2/2 VUs, 18 complete and 0 interrupted iterations
product_list   [  33% ] 2 VUs  10.0s/30s

running (0m11.0s), 2/2 VUs, 20 complete and 0 interrupted iterations
product_list   [  37% ] 2 VUs  11.0s/30s

running (0m12.0s), 2/2 VUs, 22 complete and 0 interrupted iterations
product_list   [  40% ] 2 VUs  12.0s/30s

running (0m13.0s), 2/2 VUs, 24 complete and 0 interrupted iterations
product_list   [  43% ] 2 VUs  13.0s/30s

running (0m14.0s), 2/2 VUs, 26 complete and 0 interrupted iterations
product_list   [  47% ] 2 VUs  14.0s/30s

running (0m15.0s), 2/2 VUs, 28 complete and 0 interrupted iterations
product_list   [  50% ] 2 VUs  15.0s/30s

running (0m16.0s), 2/2 VUs, 30 complete and 0 interrupted iterations
product_list   [  53% ] 2 VUs  16.0s/30s

running (0m17.0s), 2/2 VUs, 32 complete and 0 interrupted iterations
product_list   [  57% ] 2 VUs  17.0s/30s

running (0m18.0s), 2/2 VUs, 34 complete and 0 interrupted iterations
product_list   [  60% ] 2 VUs  18.0s/30s

running (0m19.0s), 2/2 VUs, 36 complete and 0 interrupted iterations
product_list   [  63% ] 2 VUs  19.0s/30s

running (0m20.0s), 2/2 VUs, 38 complete and 0 interrupted iterations
product_list   [  67% ] 2 VUs  20.0s/30s

running (0m21.0s), 2/2 VUs, 40 complete and 0 interrupted iterations
product_list   [  70% ] 2 VUs  21.0s/30s

running (0m22.0s), 2/2 VUs, 42 complete and 0 interrupted iterations
product_list   [  73% ] 2 VUs  22.0s/30s

running (0m23.0s), 2/2 VUs, 44 complete and 0 interrupted iterations
product_list   [  77% ] 2 VUs  23.0s/30s

running (0m24.0s), 2/2 VUs, 46 complete and 0 interrupted iterations
product_list   [  80% ] 2 VUs  24.0s/30s

running (0m25.0s), 2/2 VUs, 48 complete and 0 interrupted iterations
product_list   [  83% ] 2 VUs  25.0s/30s

running (0m26.0s), 2/2 VUs, 50 complete and 0 interrupted iterations
product_list   [  87% ] 2 VUs  26.0s/30s

running (0m27.0s), 2/2 VUs, 52 complete and 0 interrupted iterations
product_list   [  90% ] 2 VUs  27.0s/30s

running (0m28.0s), 2/2 VUs, 54 complete and 0 interrupted iterations
product_list   [  93% ] 2 VUs  28.0s/30s

running (0m29.0s), 2/2 VUs, 56 complete and 0 interrupted iterations
product_list   [  97% ] 2 VUs  29.0s/30s

running (0m30.0s), 2/2 VUs, 58 complete and 0 interrupted iterations
product_list   [ 100% ] 2 VUs  30s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1000' p(95)=6.59ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 240     7.940983/s
    checks_succeeded...: 100.00% 240 out of 240
    checks_failed......: 0.00%   0 out of 240

    ✓ product list status is 200
    ✓ product list has body
    ✓ health endpoint is reachable
    ✓ health returns body

    HTTP
    http_req_duration..............: avg=3.2ms min=459µs med=2.67ms max=7.66ms p(90)=6.3ms p(95)=6.59ms
      { expected_response:true }...: avg=3.2ms min=459µs med=2.67ms max=7.66ms p(90)=6.3ms p(95)=6.59ms
    http_req_failed................: 0.00% 0 out of 120
    http_reqs......................: 120   3.970492/s

    EXECUTION
    iteration_duration.............: avg=1s    min=1s    med=1s     max=1s     p(90)=1s    p(95)=1s    
    iterations.....................: 60    1.985246/s
    vus............................: 2     min=2        max=2
    vus_max........................: 2     min=2        max=2

    NETWORK
    data_received..................: 44 kB 1.4 kB/s
    data_sent......................: 11 kB 349 B/s



running (0m30.2s), 0/2 VUs, 60 complete and 0 interrupted iterations
product_list ✓ [ 100% ] 2 VUs  30s